Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc4_e_eeprom.c
/******************************************************************************
 * File Name:   e_eeprom_xmc4.c
 *
 * Description: This sourcefile implements the necessary APIs to use the flash
 * memory as emulated EEPROM in XMC4000 MCUs.
 *
 * Related Document: See README.md
 *
 ******************************************************************************
 *
 * Copyright (c) 2015-2021, Infineon Technologies AG
 * All rights reserved.
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer,
 * must be included in all copies of the Software, in whole or in part, and
 * all derivative works of the Software, unless such copies or derivative
 * works are solely in the form of machine-executable object code generated by
 * a source language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *****************************************************************************/

/*****************************************************************************
 * HEADER FILES
 ****************************************************************************/
#include "xmc4_e_eeprom.h"

#if UC_FAMILY == XMC4

/*****************************************************************************
 * MACROS
 *****************************************************************************/

/* EEPROM SECTOR numbers definitions */
#define E_EEPROM_XMC4_SECTOR_0    ((uint32_t)0U)
#define E_EEPROM_XMC4_SECTOR_1    ((uint32_t)1U)
#define E_EEPROM_XMC4_SECTOR_2    ((uint32_t)2U)
#define E_EEPROM_XMC4_SECTOR_3    ((uint32_t)3U)
#define E_EEPROM_XMC4_MAX_SECTORS ((uint32_t)4U)

/* Offset positions for CRC and user DATA definitions*/
#define E_EEPROM_XMC4_BCC_OFFSET  ((uint8_t)1U)
#define E_EEPROM_XMC4_DATA_OFFSET ((uint8_t)2U)

#if (UC_FLASH < 128UL)
#error "EEPROM NOT SUPPORTED FOR SMALL SIZE FLASH DEVICES"
#else
/* All four logical sector starting addresses defined */
#define E_EEPROM_XMC4_SECTOR0_START_ADDR   (XMC_FLASH_UNCACHED_BASE + 0x10000U)
#define E_EEPROM_XMC4_SECTOR1_START_ADDR   (XMC_FLASH_UNCACHED_BASE + 0x14000U)
#define E_EEPROM_XMC4_SECTOR2_START_ADDR   (XMC_FLASH_UNCACHED_BASE + 0x18000U)
#define E_EEPROM_XMC4_SECTOR3_START_ADDR   (XMC_FLASH_UNCACHED_BASE + 0x1C000U)
#define E_EEPROM_XMC4_SECTOR4_START_ADDR   (XMC_FLASH_UNCACHED_BASE + 0x20000U)
#endif

/* Local definitions for internal usage*/
#define E_EEPROM_XMC4_EMPTY                   ((uint32_t)0x0U)
#define E_EEPROM_XMC4_ALL_SECTORS_FILLED      ((uint8_t)0x0FU)
#define E_EEPROM_XMC4_MIN_WORDS_PER_PAGE      ((uint32_t)64U)
#define E_EEPROM_XMC4_SECTOR_SIZE             ((uint32_t)0x00004000U)
#define E_EEPROM_XMC4_SECTOR_POSITION_MASK    ((uint32_t)0x0000C000U)
#define E_EEPROM_XMC4_SECTOR_POSITION         ((uint32_t)14U)

#define E_EEPROM_XMC4_DATA_BLOCK_SIZE         (e_eeprom_xmc4_data_buffer.len)
#define E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE (8192)

#define E_EEPROM_XMC4_WORKING_BUFFER_SIZE     (E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE - (uint32_t)(8U))
#define E_EEPROM_XMC4_DATA_SIZE_FOR_CRC       (E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE - (uint32_t)(4U))
#define E_EEPROM_XMC4_MAX_PAGES               (E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE >> (uint32_t)(8U))
#define E_EEPROM_XMC4_MAX_WORDS               (E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE >> (uint32_t)(2U))

#define E_EEPROM_XMC4_FCE_KERNEL_BASE (FCE_KE0_BASE)  /**< FCE kernel number used for CRC calculation*/

/*****************************************************************************
 * Data structure Configurations
 ****************************************************************************/
/** Data structure to hold the complete state data information of sector*/
typedef struct E_EEPROM_XMC4_SECTOR_INFO
{
    uint32_t next_free_start_addr;

    uint32_t flash_data_addr;

    uint32_t  current_sector;

    uint32_t  erase_state;

} E_EEPROM_XMC4_SECTOR_INFO_t;

/* Data structure to hold the User Data block information (BCC + CRC + DATA)*/
typedef struct E_EEPROM_XMC4_RAM_BUFFER
{
    uint32_t crc;

    uint32_t block_cycle_count;

    uint8_t  eeprom_data[E_EEPROM_XMC4_WORKING_BUFFER_SIZE];

    uint32_t len;

} E_EEPROM_XMC4_RAM_BUFFER_t;

/* RAM data buffer structure definition */
static E_EEPROM_XMC4_RAM_BUFFER_t e_eeprom_xmc4_data_buffer;

/* Sector info data structure definition */
static E_EEPROM_XMC4_SECTOR_INFO_t  e_eeprom_xmc4_sector_info  =
{
        .next_free_start_addr = 0U,
        .flash_data_addr      = 0U,
        .current_sector       = 0xFFFFFFFFU,
        .erase_state          = 0U
};

/* FCE configuration data structure definition */
static const XMC_FCE_t e_eeprom_xmc4_fce =
{
        .kernel_ptr     = (XMC_FCE_Kernel_t*)(void*)E_EEPROM_XMC4_FCE_KERNEL_BASE,
        .fce_cfg_update = {{
                .config_refin  = 1U,
                .config_refout = 1U,
                .config_xsel   = 1U
        }},
        .seedvalue      = 0U
};

/*****************************************************************************
 *  * Local Function Prototypes
 ****************************************************************************/
static E_EEPROM_XMC4_STATUS_t E_EEPROM_XMC4_lWriteToFlash(void);

static void E_EEPROM_XMC4_lCopyFlashToRam(void);

static void E_EEPROM_XMC4_lInitReadSectorInfo(uint32_t sector);

