Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc4_e_eeprom.c
static E_EEPROM_XMC4_STATUS_t E_EEPROM_XMC4_lInitEraseStateMachine(void);

static uint32_t E_EEPROM_XMC4_lCalculateCRC(const uint32_t *data_start_addr);

/*****************************************************************************
 * API IMPLEMENTATION
 ****************************************************************************/
/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_Init
 ********************************************************************************
 * Summary:
 * Initialize XMC4000 emulated EEPROM application. It checks for the latest
 * written block starting from logical SECTOR 7 to SECTOR 4. If a latest block is
 * identified among any 4 sectors, the block gets copied to RAM. Hence it can be
 * read any time from RAM. If no blocks identified, SECTOR 4 is considered as
 * current active sector for future writes. If more than one SECTOR has data blocks,
 * all sectors apart from the sector having the latest data block are erased. In
 * this process,any flash errors results in "E_EEPROM_XMC4_STATUS_ERASE_ERROR" state.
 * If the sector having the latest block doesn't have any free space, the Init
 * process will copy the latest block into new free sector and erase the old sector.
 * If the copy process results in flash write errors or when all sectors filled up,
 * it returns the status E_EEPROM_XMC4_STATUS_WRITE_ERROR.
 *
 * Parameters:
 * handle - e_eeprom handle
 * len - Size of e_eeprom
 *
 * Return:
 * E_EEPROM_XMC4_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC4_STATUS_t E_EEPROM_XMC4_Init(E_EEPROM_XMC4_t *const handle, uint32_t len)
{
    uint32_t sector_count;
    E_EEPROM_XMC4_STATUS_t status ;

    XMC_ASSERT("E_EEPROM_XMC4_Init:Invalid handle Pointer", (handle != NULL))

    status = E_EEPROM_XMC4_STATUS_OK;

    if (handle->initialized == (bool)false)
    {
        if (len > E_EEPROM_XMC4_WORKING_BUFFER_SIZE)
        {
            return E_EEPROM_XMC4_STATUS_ERROR_PARAM;
        }
        e_eeprom_xmc4_data_buffer.block_cycle_count = 0U;
        e_eeprom_xmc4_sector_info.flash_data_addr = E_EEPROM_XMC4_EMPTY;
        e_eeprom_xmc4_data_buffer.len = len;

        XMC_FLASH_SetMargin(XMC_FLASH_MARGIN_TIGHT0);
        XMC_FLASH_DisableDoubleBitErrorTrap();

        XMC_FCE_Enable();

        /* Initialize FCE module for Hardware calculations */
        (void)XMC_FCE_Init(&e_eeprom_xmc4_fce);

        /* Iterate all 4 sectors to find out which is the active sector having the latest data block*/
        for (sector_count = 0U; sector_count < E_EEPROM_XMC4_MAX_SECTORS ; sector_count++)
        {
            E_EEPROM_XMC4_lInitReadSectorInfo(sector_count);
        }

        XMC_FLASH_SetMargin(XMC_FLASH_MARGIN_DEFAULT);

        /* Implement the OVER ERASE CHECK code here and return the status*/

        /* If Read was successful*/
        if (status == E_EEPROM_XMC4_STATUS_OK)
        {
            /* Execute erase state machine to free up the unwanted sectors and keep
             * only the sector which has latest valid block. If no valid block found then all sectors are emptied.
             */
            status = E_EEPROM_XMC4_lInitEraseStateMachine();

            /* If erase operations were successful, continue block data updates to RAM buffer */
            if (status == E_EEPROM_XMC4_STATUS_OK)
            {

                /* If a valid latest block were not detected, we shall assume that all sectors may be empty.
                 * Then make Sector-0 as current sector and next free address as Sector0 start address
                 */
                if (e_eeprom_xmc4_sector_info.flash_data_addr == E_EEPROM_XMC4_EMPTY)
                {
                    e_eeprom_xmc4_sector_info.current_sector = E_EEPROM_XMC4_SECTOR_0;
                    e_eeprom_xmc4_sector_info.next_free_start_addr =  E_EEPROM_XMC4_SECTOR0_START_ADDR;
                }
                else
                {
                    /* If a valid latest block was detected, copy the valid block from flash to RAM. */
                    E_EEPROM_XMC4_lCopyFlashToRam();

                    if ((e_eeprom_xmc4_sector_info.next_free_start_addr - e_eeprom_xmc4_sector_info.flash_data_addr) != (e_eeprom_xmc4_data_buffer.len * 2))
                    {
                        status = E_EEPROM_XMC4_STATUS_ERROR_OLD_DATA;
                    }

                    if (e_eeprom_xmc4_sector_info.next_free_start_addr >= E_EEPROM_XMC4_SECTOR4_START_ADDR)
                    {
                        e_eeprom_xmc4_sector_info.next_free_start_addr =  E_EEPROM_XMC4_SECTOR0_START_ADDR;
                    }

                }
            }
        }

        XMC_FLASH_EnableDoubleBitErrorTrap();

        handle->initialized = (bool)true;
    }

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_WriteByte
 ********************************************************************************
 * Summary:
 * Update a particular byte in the RAM copy of data block.
 *
 * Parameters:
 * offset_address - Address offset
 * value - Data to write
 *
 * Return:
 * E_EEPROM_XMC4_WriteByte
 *
 *******************************************************************************/
bool E_EEPROM_XMC4_WriteByte(const uint16_t offset_address, const uint8_t value)
{
    uint8_t *address_ptr;
    bool status;

    XMC_ASSERT("E_EEPROM_XMC4_WriteByte: Wrong offset address", (offset_address  < E_EEPROM_XMC4_DATA_BLOCK_SIZE))
    address_ptr = (uint8_t*)(void*)(&e_eeprom_xmc4_data_buffer.eeprom_data) + (uint32_t)offset_address;
    status = (*address_ptr != value);

    *address_ptr = value;

    return status;
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_WriteArray
 ********************************************************************************
 * Summary:
 * Update a set of bytes in the RAM copy of data block.
 *
 * Parameters:
 * offset_address - offset address
 * data - data to write
 * length - length of data
 *
 * Return:
 * uint32_t
 *
 *******************************************************************************/
bool E_EEPROM_XMC4_WriteArray(const uint16_t offset_address, const uint8_t *const data, const uint16_t length)
{
    uint16_t i;
    uint8_t  *address_ptr;
    bool status;

