Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc4_e_eeprom.c
    XMC_ASSERT("E_EEPROM_XMC4_WriteArray: Wrong offset address", (offset_address  < E_EEPROM_XMC4_DATA_BLOCK_SIZE))
    XMC_ASSERT("E_EEPROM_XMC4_WriteArray: Wrong length",
            ((offset_address + length)  < E_EEPROM_XMC4_DATA_BLOCK_SIZE))

            address_ptr = (uint8_t*)(void*)(&e_eeprom_xmc4_data_buffer.eeprom_data) + (uint32_t)offset_address;
    status = (memcmp(address_ptr, data, length) != 0);

    for (i = 0U; i < length; i++)
    {
        *(address_ptr + i) = *(data + i);
    }

    return status;
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_ReadByte
 ********************************************************************************
 * Summary:
 * Reads a particular byte from the RAM copy of data block.
 *
 * Parameters:
 * offset_address - offset address
 * value - variable to store read data
 *
 * Return:
 * void
 *
 *******************************************************************************/
void E_EEPROM_XMC4_ReadByte(const uint16_t offset_address, uint8_t *const value)
{
    uint8_t *address_ptr;
    XMC_ASSERT("E_EEPROM_XMC4_ReadByte: Wrong offset address", (offset_address  < E_EEPROM_XMC4_DATA_BLOCK_SIZE))
    address_ptr = (uint8_t*)(void*)(&e_eeprom_xmc4_data_buffer.eeprom_data) + (uint32_t)offset_address;

    *value = *address_ptr;
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_ReadArray
 ********************************************************************************
 * Summary:
 * Reads a set of bytes from the RAM copy of data block.
 *
 * Parameters:
 * offset_address - offset address
 * data - data to write
 * length - length of data
 *
 * Return:
 * uint32_t
 *
 *******************************************************************************/
void E_EEPROM_XMC4_ReadArray(const uint16_t offset_address, uint8_t *const data, const uint16_t length)
{
    uint16_t i;
    uint8_t  *address_ptr;
    XMC_ASSERT("E_EEPROM_XMC4_ReadArray: Wrong offset address", (offset_address  < E_EEPROM_XMC4_DATA_BLOCK_SIZE))
    XMC_ASSERT("E_EEPROM_XMC4_ReadArray: Wrong length",
            ((offset_address + length)  < E_EEPROM_XMC4_DATA_BLOCK_SIZE))
            address_ptr = (uint8_t*)(void*)(&e_eeprom_xmc4_data_buffer.eeprom_data) + (uint32_t)offset_address;

    for (i = 0U; i<length; i++)
    {
        *(data + i) = *(address_ptr + i);
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_UpdateFlashContents
 ********************************************************************************
 * Summary:
 * Programs the RAM buffer into emulated area of the FLASH. On successful
 * completion of this API, the data block gets saved in the flash. Hence data
 * retention is possible over reset cycles. Call this API only in the POWER DOWN
 * cycle to ensure the flash endurance.
 *
 * Parameters:
 * void
 *
 * Return:
 * E_EEPROM_XMC4_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC4_STATUS_t E_EEPROM_XMC4_UpdateFlashContents(void)
{
    E_EEPROM_XMC4_STATUS_t status;
    uint32_t sector_start_addr;

    status = E_EEPROM_XMC4_STATUS_OK;

    /* Calculate the starting address of the active sector from where the first write started for the current cycle*/
    sector_start_addr = E_EEPROM_XMC4_SECTOR0_START_ADDR +
            (E_EEPROM_XMC4_SECTOR_SIZE * e_eeprom_xmc4_sector_info.current_sector);

    /* If the next free address crosses current active sector starting address, then all the sectors are fully written*/
    if ((e_eeprom_xmc4_sector_info.next_free_start_addr == sector_start_addr) &&
            (e_eeprom_xmc4_data_buffer.block_cycle_count != 0U))
    {
        /* Update the current sector to the latest sector on which the last write was executed. */
        e_eeprom_xmc4_sector_info.current_sector =  ((e_eeprom_xmc4_sector_info.flash_data_addr &
                E_EEPROM_XMC4_SECTOR_POSITION_MASK) >>
                E_EEPROM_XMC4_SECTOR_POSITION);

        /* Mark all the sectors as filled with data */
        e_eeprom_xmc4_sector_info.erase_state = E_EEPROM_XMC4_ALL_SECTORS_FILLED ;

        /* Execute erase state machine to free up the unwanted sectors and keep only the sector which has latest block*/
        status = E_EEPROM_XMC4_lInitEraseStateMachine();
    }

    if (status ==  E_EEPROM_XMC4_STATUS_OK)
    {
        e_eeprom_xmc4_data_buffer.block_cycle_count++;

        status = E_EEPROM_XMC4_lWriteToFlash();

        /* If the flash write succeeds, update the latest flash data location in RAM for reference */
        if (status == E_EEPROM_XMC4_STATUS_OK)
        {
            e_eeprom_xmc4_sector_info.flash_data_addr = e_eeprom_xmc4_sector_info.next_free_start_addr;
        }

        /* Update the next free address to write the new data block*/
        e_eeprom_xmc4_sector_info.next_free_start_addr += E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE;

        /* If the next free address crosses 3rd sector end address relocate the address to 0th sector starting address*/
        if (e_eeprom_xmc4_sector_info.next_free_start_addr >= E_EEPROM_XMC4_SECTOR4_START_ADDR)
        {
            e_eeprom_xmc4_sector_info.next_free_start_addr = E_EEPROM_XMC4_SECTOR0_START_ADDR;
        }
    }

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_IsFlashEmpty
 ********************************************************************************
 * Summary:
 * Check at least one data block is available in the flash emulated EEPROM.
 *
 * Parameters:
 * void
 *
 * Return:
 * bool
 *
 *******************************************************************************/
bool E_EEPROM_XMC4_IsFlashEmpty(void)
{
    bool status = false;

    /* If data available flash_data_addr will have a valid address*/
    if (e_eeprom_xmc4_sector_info.flash_data_addr == 0U)
    {
        status = true;
    }
    return (status);
}

