Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc4_e_eeprom.c
/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_lWriteToFlash
 ********************************************************************************
 * Summary:
 * Local function to program data blocks from RAM into FLASH
 *
 * Parameters:
 * void
 *
 * Return:
 * E_EEPROM_XMC4_STATUS_t
 *
 *******************************************************************************/
static E_EEPROM_XMC4_STATUS_t E_EEPROM_XMC4_lWriteToFlash(void)
{
    uint32_t *flash_addr_ptr;
    uint32_t *ram_addr_ptr;
    uint32_t  page_index;
    E_EEPROM_XMC4_STATUS_t status;

    status = E_EEPROM_XMC4_STATUS_OK;
    flash_addr_ptr = (uint32_t*)e_eeprom_xmc4_sector_info.next_free_start_addr;
    ram_addr_ptr   = (uint32_t*)(void*)&e_eeprom_xmc4_data_buffer;

    e_eeprom_xmc4_data_buffer.crc = E_EEPROM_XMC4_lCalculateCRC((uint32_t*)(void*)
            (&(e_eeprom_xmc4_data_buffer.block_cycle_count)));

    for (page_index = 0U ; page_index < E_EEPROM_XMC4_MAX_PAGES; page_index++)
    {
        XMC_FLASH_ClearStatus();

        XMC_FLASH_ProgramPage(flash_addr_ptr,ram_addr_ptr);

        if (XMC_FLASH_GetStatus() == (uint32_t)XMC_FLASH_STATUS_VERIFY_ERROR)
        {
            status = E_EEPROM_XMC4_STATUS_WRITE_ERROR;
            break;
        }
        ram_addr_ptr   += E_EEPROM_XMC4_MIN_WORDS_PER_PAGE ;
        flash_addr_ptr += E_EEPROM_XMC4_MIN_WORDS_PER_PAGE ;
    }

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_lInitReadSectorInfo
 ********************************************************************************
 * Summary:
 * Read sector info
 *
 * Parameters:
 * sector
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC4_lInitReadSectorInfo(const uint32_t sector)
{
    uint32_t block_read_addr;
    uint32_t sector_start_addr;
    uint32_t free_block_addr;
    uint32_t *data_ptr;
    uint32_t block_cycle_count;
    uint32_t written_crc;
    uint32_t calculated_crc;

    /* Initialize starting address and last block address of the sector. */
    sector_start_addr = E_EEPROM_XMC4_SECTOR0_START_ADDR + (E_EEPROM_XMC4_SECTOR_SIZE * (uint32_t)sector);
    block_read_addr = (sector_start_addr + E_EEPROM_XMC4_SECTOR_SIZE) - E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE;
    free_block_addr = E_EEPROM_XMC4_EMPTY;

    do
    {
        /* Read first 32 bit data from the block which indicates the block cycle counter. */
        data_ptr = (uint32_t*)block_read_addr;
        block_cycle_count = *(data_ptr + E_EEPROM_XMC4_BCC_OFFSET);

        /* Check if block cycle count is a non zero value*/
        if (block_cycle_count != E_EEPROM_XMC4_EMPTY)
        {
            /* Mark sector as non-empty sector*/
            e_eeprom_xmc4_sector_info.erase_state |= ((uint32_t)1U << sector);

            /* If this is the first non empty block identified, then store the address as next free address */
            if (free_block_addr == E_EEPROM_XMC4_EMPTY)
            {
                free_block_addr = block_read_addr + E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE;
            }

            /* Read the second 32bit data which indicates the CRC */
            written_crc = *data_ptr;
            /* Calculate the CRC for the written data in flash (3rd word to the last word)*/
            calculated_crc = E_EEPROM_XMC4_lCalculateCRC(data_ptr + E_EEPROM_XMC4_BCC_OFFSET);

            if (calculated_crc == written_crc)
            {
                /* If both CRC matches and the current block cycle counter is greater than the previous recorded value,
                 * Update the Data structure with the current block as the "latest" one and the current sector as "active".
                 * Exit from the function.
                 */
                if (block_cycle_count > e_eeprom_xmc4_data_buffer.block_cycle_count)
                {
                    e_eeprom_xmc4_data_buffer.block_cycle_count = block_cycle_count;
                    e_eeprom_xmc4_sector_info.current_sector = sector;
                    e_eeprom_xmc4_sector_info.flash_data_addr = block_read_addr;
                    e_eeprom_xmc4_sector_info.next_free_start_addr = free_block_addr;
                    break;
                }
            }
        }
        /* Move the block read address to one block size up starting from the bottom of sector */
        block_read_addr -= E_EEPROM_XMC4_ACTUAL_FLASH_BLOCK_SIZE;

        /* Iterate the read process until the block read address crosses sector start address or a
         * latest valid block is identified.
         */
    } while ( block_read_addr >= sector_start_addr );

}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_lInitEraseStateMachine
 ********************************************************************************
 * Summary:
 * Init erase state machine
 *
 * Parameters:
 * void
 *
 * Return:
 * E_EEPROM_XMC4_STATUS_t
 *
 *******************************************************************************/
static E_EEPROM_XMC4_STATUS_t E_EEPROM_XMC4_lInitEraseStateMachine(void)
{
    uint32_t sector_count;
    uint32_t sector_start_addr;
    E_EEPROM_XMC4_STATUS_t status ;

    status = E_EEPROM_XMC4_STATUS_OK;
    sector_count = 0U;

    do
    {
        /* If the non empty sector is the current active sector, then do not erase it*/
        if (e_eeprom_xmc4_sector_info.current_sector != sector_count)
        {
            /* Check if the sector was previously identified as non-empty. i.e It is having old data or corrupted data
             * If so erase the sector and mark it as erase attempted.
             */
            if ((e_eeprom_xmc4_sector_info.erase_state >> sector_count) & ((uint32_t)1U))
            {
                sector_start_addr = E_EEPROM_XMC4_SECTOR0_START_ADDR + (E_EEPROM_XMC4_SECTOR_SIZE * (uint32_t)sector_count);

                XMC_FLASH_ClearStatus();
                XMC_FLASH_EraseSector((uint32_t*)sector_start_addr);

