Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc4_e_eeprom.c
                if (XMC_FLASH_GetStatus() != (uint32_t)XMC_FLASH_STATUS_ERASE_STATE)
                {
                    status = E_EEPROM_XMC4_STATUS_ERASE_ERROR;
                    break;
                }
                e_eeprom_xmc4_sector_info.erase_state &= ~(((uint32_t)1U << sector_count));
            }
        }
        sector_count++;
        /* Iterate the erase loop until all 4 sectors are checked. Break and return failure on any sector erase errors.*/
    } while ( sector_count < E_EEPROM_XMC4_MAX_SECTORS );

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_lCalculateCRC
 ********************************************************************************
 * Summary:
 * Local function to CRC
 *
 * Parameters:
 * data_start_addr - Data start address
 *
 * Return:
 * uint32_t
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC4_lCalculateCRC(const uint32_t *data_start_addr)
{
    uint32_t result;

    /* Reset the CRC result register before new CRC calculation */
    XMC_FCE_InitializeSeedValue(&e_eeprom_xmc4_fce, 0U);

    (void)XMC_FCE_CalculateCRC32(&e_eeprom_xmc4_fce, data_start_addr, E_EEPROM_XMC4_DATA_SIZE_FOR_CRC, &result);

    return (result);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC4_lCopyFlashToRam
 ********************************************************************************
 * Summary:
 * Local function to copy data blocks from FLASH to RAM
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC4_lCopyFlashToRam(void)
{
    uint32_t *flash_addr_ptr;
    uint32_t *ram_addr_ptr;
    uint32_t byte_index;

    flash_addr_ptr = (uint32_t*)e_eeprom_xmc4_sector_info.flash_data_addr;
    ram_addr_ptr = (uint32_t*)(void*)&e_eeprom_xmc4_data_buffer;

    for(byte_index = 0U ; byte_index < E_EEPROM_XMC4_MAX_WORDS; byte_index++)
    {
        *(ram_addr_ptr + byte_index) = *(flash_addr_ptr + byte_index);
    }
}
#endif
